test/newMeshMorphing/moorDynBoxInWaves_v2/newMeshMorphing/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverListFvMesh;

solvers
{
    box
    {
        motionSolverLibs ( floaterMotion );

        motionSolver    floaterMotion;

        floaterMotionCoeffs
        {
            patches         (box);
            innerDistance   0.075;
            outerDistance   0.4;
            separateTransRotPointDisplacement true;
            horDir1         (1 0 0);
            horDir2         (0 1 0);
            verDir          (0 0 1);
            horPos1         4 (-1.5 -0.4 0.4 1.5);
            horPos2         4 (-1e10 -1e9 1e9 1e10);
//            verPosX         $horPos1;
            verPos         4 (-0.39 -0.21 0.19 0.39);

            linDirs   (1 0 1);
            rotDirs   (0 1 0);
            addedMassModel  pisoAddedMass;
            MaddUpdateFreq  1;

            restraints
            {
                moorDynR2_body
                {
                    floaterMotionRestraint  moorDynR2;
                    couplingMode        "BODY";
                    inputFile           "Mooring/lines_v2_bodyC.txt";
                    vtkPrefix           "mdv2_body";
                    writeMooringVTK     true;
                    vtkStartTime        0;
                    outerCorrector      1;
                }

            }
        }
    }
}


// ************************************************************************* //
